Revit 2026 API

# SpatialFieldManagerSetMeasurementDescriptions Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMeasurementDescriptions(
	IList<string> measurementDescriptions
)
```
```vb
Public Sub SetMeasurementDescriptions (
	measurementDescriptions As IList(Of String)
)
```
```cpp
public:
void SetMeasurementDescriptions(
	IList<String^>^ measurementDescriptions
)
```
```fsharp
member SetMeasurementDescriptions :
        measurementDescriptions : IList<string> -> unit
```

#### Parameters

measurementDescriptions IListString

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace